OctoberProject3/fio/bs_sweep_seq_result.txt
seq4k: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
seq16k: (g=1): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=8
seq32k: (g=2): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=8
seq64k: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
seq128k: (g=4): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=8
seq256k: (g=5): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=8
fio-3.36
Starting 6 processes
3;fio-3.36;seq4k;0;0;74350180;1239149;309787;60001;0;1768;1.237548;0.878638;7;2119;24.416612;32.511179;95.000000%=35;99.000000%=218;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;8;2146;25.654160;32.498395;619032;1680368;99.970978%;1238789.378151;278651.846007;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;14.153333%;50.046667%;5794704;0;19;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;82.73%;13.30%;1.07%;2.76%;0.12%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;36869497;749;0;288;3159974;143;3160146;87.20%
3;fio-3.36;seq16k;1;0;158940752;2648968;165560;60001;1;752;2.265109;0.888983;9;2381;45.906213;63.731801;95.000000%=222;99.000000%=240;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;11;2391;48.171323;63.725228;1262922;3289664;100.000000%;2653102.781513;421087.037034;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;6.101667%;39.830000%;527477;0;43;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.01%;65.82%;20.10%;1.05%;12.73%;0.30%;0.01%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;36869497;749;0;288;3159974;143;3160146;87.20%
3;fio-3.36;seq32k;2;0;79225888;1320409;41262;60001;2;1803;2.918184;1.755394;12;2041;190.792427;97.204701;95.000000%=387;99.000000%=387;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;15;2044;193.710611;97.221805;1222144;1425472;100.000000%;1321242.815126;37640.043833;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.071667%;16.101667%;1729319;0;75;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;16.07%;13.21%;60.90%;9.82%;0.01%;0.00%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;36869497;749;0;288;3159974;143;3160146;87.20%
3;fio-3.36;seq64k;3;0;115878912;1931283;30176;60001;3;240;4.517594;1.533111;18;2415;260.414765;111.932686;95.000000%=407;99.000000%=411;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;22;2442;264.932359;111.883774;1897344;1986816;100.000000%;1932035.563025;26016.074827;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.598333%;17.820000%;1682390;0;140;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;0.05%;1.75%;48.97%;49.16%;0.06%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;36869497;749;0;288;3159974;143;3160146;87.20%
3;fio-3.36;seq128k;4;0;151950976;2532474;19784;60001;6;874;7.822808;2.048271;52;2279;396.337072;119.912790;95.000000%=528;99.000000%=528;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;60;2336;404.159879;119.882628;2491511;2590720;100.000000%;2533683.554622;23574.628290;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.983333%;19.021667%;1175711;0;267;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;18.72%;58.10%;23.16%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;36869497;749;0;288;3159974;143;3160146;87.20%
3;fio-3.36;seq256k;5;0;369217280;6153518;24037;60001;13;901;14.747234;2.156527;135;2189;317.902442;11.093843;95.000000%=321;99.000000%=325;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;157;2252;332.649676;11.112236;6111744;6173184;100.000000%;6157349.563025;10610.653476;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.146667%;40.396667%;1437377;0;521;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.07%;99.86%;0.07%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;36869497;749;0;288;3159974;143;3160146;87.20%

seq4k: (groupid=0, jobs=1): err= 0: pid=42946: Wed Oct  1 17:52:39 2025
  read: IOPS=310k, BW=1210MiB/s (1269MB/s)(70.9GiB/60001msec)
    slat (nsec): min=689, max=1768.9k, avg=1237.55, stdev=878.64
    clat (usec): min=7, max=2119, avg=24.42, stdev=32.51
     lat (usec): min=8, max=2146, avg=25.65, stdev=32.50
    clat percentiles (usec):
     |  95th=[   36],  99th=[  219]
   bw (  MiB/s): min=  604, max= 1640, per=99.97%, avg=1209.76, stdev=272.12, samples=119
   iops        : min=154758, max=420092, avg=309697.29, stdev=69662.94, samples=119
  lat (usec)   : 10=0.01%, 20=82.73%, 50=13.30%, 100=1.07%, 250=2.76%
  lat (usec)   : 500=0.12%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=14.15%, sys=50.05%, ctx=5794704, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=18587545,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
seq16k: (groupid=1, jobs=1): err= 0: pid=43236: Wed Oct  1 17:52:39 2025
  read: IOPS=166k, BW=2587MiB/s (2713MB/s)(152GiB/60001msec)
    slat (nsec): min=1390, max=752574, avg=2265.11, stdev=888.98
    clat (usec): min=9, max=2381, avg=45.91, stdev=63.73
     lat (usec): min=11, max=2391, avg=48.17, stdev=63.73
    clat percentiles (usec):
     |  95th=[  223],  99th=[  241]
   bw (  MiB/s): min= 1233, max= 3212, per=100.00%, avg=2590.92, stdev=411.22, samples=119
   iops        : min=78932, max=205604, avg=165818.82, stdev=26317.94, samples=119
  lat (usec)   : 10=0.01%, 20=65.82%, 50=20.10%, 100=1.05%, 250=12.73%
  lat (usec)   : 500=0.30%, 750=0.01%, 1000=0.01%
  lat (msec)   : 4=0.01%
  cpu          : usr=6.10%, sys=39.83%, ctx=527477, majf=0, minf=43
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9933797,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
seq32k: (groupid=2, jobs=1): err= 0: pid=43516: Wed Oct  1 17:52:39 2025
  read: IOPS=41.3k, BW=1289MiB/s (1352MB/s)(75.6GiB/60001msec)
    slat (usec): min=2, max=1803, avg= 2.92, stdev= 1.76
    clat (usec): min=12, max=2041, avg=190.79, stdev=97.20
     lat (usec): min=15, max=2044, avg=193.71, stdev=97.22
    clat percentiles (usec):
     |  95th=[  388],  99th=[  388]
   bw (  MiB/s): min= 1193, max= 1392, per=100.00%, avg=1290.28, stdev=36.76, samples=119
   iops        : min=38192, max=44546, avg=41288.72, stdev=1176.26, samples=119
  lat (usec)   : 20=0.01%, 50=16.07%, 100=13.21%, 250=60.90%, 500=9.82%
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.07%, sys=16.10%, ctx=1729319, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2475809,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
seq64k: (groupid=3, jobs=1): err= 0: pid=43797: Wed Oct  1 17:52:39 2025
  read: IOPS=30.2k, BW=1886MiB/s (1978MB/s)(111GiB/60001msec)
    slat (usec): min=3, max=240, avg= 4.52, stdev= 1.53
    clat (usec): min=18, max=2415, avg=260.41, stdev=111.93
     lat (usec): min=22, max=2442, avg=264.93, stdev=111.88
    clat percentiles (usec):
     |  95th=[  408],  99th=[  412]
   bw (  MiB/s): min= 1852, max= 1940, per=100.00%, avg=1886.75, stdev=25.41, samples=119
   iops        : min=29646, max=31044, avg=30187.96, stdev=406.50, samples=119
  lat (usec)   : 20=0.01%, 50=0.05%, 100=1.75%, 250=48.97%, 500=49.16%
  lat (usec)   : 750=0.06%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.60%, sys=17.82%, ctx=1682390, majf=0, minf=140
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1810608,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
seq128k: (groupid=4, jobs=1): err= 0: pid=44077: Wed Oct  1 17:52:39 2025
  read: IOPS=19.8k, BW=2473MiB/s (2593MB/s)(145GiB/60001msec)
    slat (usec): min=6, max=874, avg= 7.82, stdev= 2.05
    clat (usec): min=52, max=2279, avg=396.34, stdev=119.91
     lat (usec): min=60, max=2336, avg=404.16, stdev=119.88
    clat percentiles (usec):
     |  95th=[  529],  99th=[  529]
   bw (  MiB/s): min= 2433, max= 2530, per=100.00%, avg=2474.30, stdev=23.02, samples=119
   iops        : min=19464, max=20240, avg=19794.31, stdev=184.15, samples=119
  lat (usec)   : 100=0.01%, 250=18.72%, 500=58.10%, 750=23.16%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=0.98%, sys=19.02%, ctx=1175711, majf=0, minf=267
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1187117,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
seq256k: (groupid=5, jobs=1): err= 0: pid=44379: Wed Oct  1 17:52:39 2025
  read: IOPS=24.0k, BW=6009MiB/s (6301MB/s)(352GiB/60001msec)
    slat (usec): min=13, max=901, avg=14.75, stdev= 2.16
    clat (usec): min=135, max=2189, avg=317.90, stdev=11.09
     lat (usec): min=157, max=2252, avg=332.65, stdev=11.11
    clat percentiles (usec):
     |  95th=[  322],  99th=[  326]
   bw (  MiB/s): min= 5968, max= 6028, per=100.00%, avg=6013.04, stdev=10.36, samples=119
   iops        : min=23874, max=24114, avg=24052.15, stdev=41.43, samples=119
  lat (usec)   : 250=0.07%, 500=99.86%, 750=0.07%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.15%, sys=40.40%, ctx=1437377, majf=0, minf=521
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1442255,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1210MiB/s (1269MB/s), 1210MiB/s-1210MiB/s (1269MB/s-1269MB/s), io=70.9GiB (76.1GB), run=60001-60001msec

Run status group 1 (all jobs):
   READ: bw=2587MiB/s (2713MB/s), 2587MiB/s-2587MiB/s (2713MB/s-2713MB/s), io=152GiB (163GB), run=60001-60001msec

Run status group 2 (all jobs):
   READ: bw=1289MiB/s (1352MB/s), 1289MiB/s-1289MiB/s (1352MB/s-1352MB/s), io=75.6GiB (81.1GB), run=60001-60001msec

Run status group 3 (all jobs):
   READ: bw=1886MiB/s (1978MB/s), 1886MiB/s-1886MiB/s (1978MB/s-1978MB/s), io=111GiB (119GB), run=60001-60001msec

Run status group 4 (all jobs):
   READ: bw=2473MiB/s (2593MB/s), 2473MiB/s-2473MiB/s (2593MB/s-2593MB/s), io=145GiB (156GB), run=60001-60001msec

Run status group 5 (all jobs):
   READ: bw=6009MiB/s (6301MB/s), 6009MiB/s-6009MiB/s (6301MB/s-6301MB/s), io=352GiB (378GB), run=60001-60001msec

Disk stats (read/write):
  nvme0n1: ios=36869497/749, sectors=1896578032/22704, merge=0/288, ticks=3159974/143, in_queue=3160146, util=87.20%